1) Используя оператор switch напишите программу, которая принимает от пользователя день недели и выводит этот день на консоль, и не забудьте учесть случай, если число не от 1 до 7.

2) Напишите программу, которая возводит число 2 в степень 10 с помощью цикла while.

3) Напишите программу, которая запрашивает у пользователя целое число n и выводит на экран факториал этого числа. Факториал числа n — это произведение всех натуральных чисел от 1 до n. Используй цикл while и переменную для хранения результата. 

4) Напишите программу, которая запрашивает у пользователя целое число n и выводит на экран все четные числа от 0 до n включительно.

5) Перепишите данный код, с использованием цикла for: 
```
    int x = 10;
        while(x > 0){
            cout << x << endl;
            x-=2;
        }
```
6) Напишите программу, которая считает сумму чисел от 1 до 100, но останавливается, когда сумма станет больше 1000 и выводит полученную сумму.

7) Напишите программу, которая запрашивает у пользователя целое число n и проверяет, является ли оно простым. Простое число — это число, которое делится только на себя и на единицу. Используйте цикл for и оператор break для прерывания цикла, если найден делитель числа.

8) Напишите программу (интерактивный консольный калькулятор), которая запрашивает у пользователя на выбор математическую операцию (операторы: + - * / ! ^, где "^" - возведение в степень, а "!" - факториал) и целые числа, с которыми нужно выполнить эту операцию. Программа должна выводить результат выполнения выбранной математической операции.