1) Дан массив int array[7] = {2, 3, 4, 5, 2, 8, 10};. Выведите на консоль все его элементы.

2) Напишите код, который найдёт сумму всех элементов массива int arr[ ] = {500, 4, 24, 15, 100, 105} с помощью цикла for и с помощью цикла while.

3) Напишите программу, которая считает количество элементов в массиве, кратных числу, которое вводится с консоли.

4) Дан массив int arr[] = {5, 4, 3, 4, 9};
	Найдите разницу между самым большим и самым маленьким элементом массива.

5) Дан массив int arr[] = {5, 4, 3, 4, 9};
Найдите позицию максимального элемента массива.
Например, 3 — минимальный элемент, его позиция 2. Эта задача немного сложнее, чем просто нахождение максимума, тут нам понадобится еще одна переменная, которая будет хранить позицию текущего максимума.

6) Допишите программу, которая будет считать сумму элементов динамического массива.
```
#include <iostream>

using namespace std;

int main() {
    
    int size = 10;
    int* arr= new int[size] ;
    int16_t sum;
    
    for (int i = 0; i < size; i++) {
        arr[i]=i;
    }
    
    for (int i = 0; i < size; i++)  {
	
    }
}

```
7) Допишите программу по развороту динамического массива.
Пример: если массив был [1, 2, 3, 4, 5], то должен стать [5, 4, 3, 2, 1]. Не забывайте про освобождение памяти!
```
#include <iostream>
#include <cstring>

using namespace std;

int main() {
    
    int size = 5; 
    int* arr= new int[size];
    int16_t sum;
    
    for (int i = 0; i < size; i++) {
       cin >> arr[i];
    }
    
    for () {

    }
    

    for (int i = 0; i < size; i++)  {
        cout << arr[i];
    }

    return 0;
}

```
8) Подсчитайте количество прописных (заглавных) букв в строке.
```
char stroka[] = {"AaBbCcDdEeFfGgggggg"};
```
 
9) Подсчитайте количество вхождений буквы "A" в этой строке. Не забывайте, что буква "A" должна быть английской, а не русской.
```
char stroka[] = {"Aaa1323#aa"};
```
10) Дана строка, содержащая только строчные буквы. Замените все буквы в строке на заглавные, выведите результат.
```
char stroka[] = {"aaaabbbbccccdddd"};
```

